Enums/РаботаСДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>РаботаСДанными</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сохранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноеПроведение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданиеНового</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НепосредственноеУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПометкаНаУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеПометкиНаУдаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносВДругуюГруппу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПометкаНаУдалениеПроведенногоДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЖурналСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЖурналСобытий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаботаСДанными</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОбъектовЖурналСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДаныеСобытия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиДока</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитДокументаСобытия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтароеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовоеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТипыОбъектовЖурналСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ТипыОбъектовЖурналСобытий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УправлениеЖурналомСобытий/Ext/Module.bsl
Функция СоздатьНовоеСобытие(ЭлементЖурналаСобытий = Неопределено,Объект,Ссылка,ИмяРеквизитаДокумента = "",СтарыйРеквизитДокумента = "",НовыйРеквизитДокумента = "",ИмяТабЧасти = "",НомерСтрокиТД = "",Событие,ТипОбъекта = "")Экспорт 
	
	Если ЭлементЖурналаСобытий = Неопределено тогда
		ЭлементЖурналаСобытий						= Справочники.ЖурналСобытий.СоздатьЭлемент();
		ЭлементЖурналаСобытий.ВремяДата				= ТекущаяДата();
		ЭлементЖурналаСобытий.Объект				= Ссылка.УникальныйИдентификатор();
		//ЭлементЖурналаСобытий.КомпьютерНаименование	= ИмяКомпьютера();
		//ЭлементЖурналаСобытий.ГуидОбъекта			= Ссылка.УникальныйИдентификатор();
		ЭлементЖурналаСобытий.УстановитьНовыйКод();
		
		Тип = ?(ЗначениеЗаполнено(ТипОбъекта),ТипОбъекта,ТипЗнч(Ссылка)); 
		Вид = Ссылка.Метаданные().Имя;
		//ЭлементЖурналаСобытий.Наименование			= Тип;
		//ЭлементЖурналаСобытий.НаименованиеПолное	= Вид;
		
		СпрТипСсылка = Справочники.ТипыОбъектовЖурналСобытий.НайтиПоНаименованию(Тип+"."+Вид,Истина);
		Если СпрТипСсылка.Пустая() Тогда 
			НовЕл = Справочники.ТипыОбъектовЖурналСобытий.СоздатьЭлемент();
			НовЕл.Наименование = Тип+"."+Вид;
			Если Тип = "Справочник" Тогда 
				НовЕл.Родитель = Справочники.ТипыОбъектовЖурналСобытий.Справочник;
			ИначеЕсли 	Тип = "Документ" Тогда 
				НовЕл.Родитель = Справочники.ТипыОбъектовЖурналСобытий.Документ;
			ИначеЕсли 	Тип = "ПланВидовХарактеристик" Тогда 
				НовЕл.Родитель = Справочники.ТипыОбъектовЖурналСобытий.ПланВидовХарактеристик;
			ИначеЕсли 	Тип = "Задача" Тогда 
				НовЕл.Родитель = Справочники.ТипыОбъектовЖурналСобытий.Задача;
			ИначеЕсли 	Тип = "БизнесПроцесс" Тогда 
				НовЕл.Родитель = Справочники.ТипыОбъектовЖурналСобытий.БизнесПроцесс;
			КонецЕсли;
			НовЕл.Записать();
			СпрТипСсылка = НовЕл.Ссылка;
		КонецЕсли;	
		ЭлементЖурналаСобытий.ТипОбъекта = СпрТипСсылка;
		
		
		ЭлементЖурналаСобытий.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
		ЭлементЖурналаСобытий.Примечание 			= СокрЛП(Объект);
	КонецЕсли;
	ЭлементЖурналаСобытий.Событие=Событие; 
	
	Если  ЗначениеЗаполнено(ИмяРеквизитаДокумента)   тогда
		СтрокаЭлементЖурналаСобытий=ЭлементЖурналаСобытий.ДаныеСобытия.Добавить();
		СтрокаЭлементЖурналаСобытий.РеквизитДокументаСобытия = ИмяРеквизитаДокумента;
		СтрокаЭлементЖурналаСобытий.СтароеЗначение           = СтарыйРеквизитДокумента;
		СтрокаЭлементЖурналаСобытий.НовоеЗначение            = НовыйРеквизитДокумента;
		СтрокаЭлементЖурналаСобытий.НазваниеТабличнойЧасти   = ИмяТабЧасти;
		СтрокаЭлементЖурналаСобытий.НомерСтрокиДока          = НомерСтрокиТД;
	КонецЕсли;
КонецФункции	

Функция ПреобразоватьВСтроку(СтрокаТаблицы)
	СтрокаТаблицыСтр="";
	Для Каждого рекв из  СтрокаТаблицы  цикл
		СтрокаТаблицыСтр=СтрокаТаблицыСтр+рекв+", ";	
	Конеццикла;	  
	Возврат СтрокаТаблицыСтр ;
Конецфункции	


//Функция сравнивает две таблицы значений на идентичность структуры и данных
//
// Параметры
//  ТаблицаЗначений1 - ТаблицаЗначений для сравнения
//  ТаблицаЗначений2 - ТаблицаЗначений для сравнения
//
// Возвращаемое значение:
//   Булево, идентичны или нет две таблицы
//
Функция СравнитьТаблицыЗначений(ЭлементЖурналаСобытий,Объект,Ссылка,ТаблицаЗначений1, ТаблицаЗначений2,ИмяТаблицы,Событие,ТипОбъекта)
	
	Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если (ТаблицаЗначений1.Количество() = 0) и (ТаблицаЗначений2.Количество() = 0) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
		СтруктураПоиска = Новый Структура;
		
		Если ТаблицаЗначений2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого СтрокаТаблицы Из ТаблицаЗначений1 Цикл
			
			Попытка
				
				Если СтрокаТаблицы[Колонка.Имя] <> ТаблицаЗначений2[ТаблицаЗначений1.Индекс(СтрокаТаблицы)][Колонка.Имя] Тогда
					Если Событие <> Перечисления.РаботаСДанными.Изменение  тогда
						Событие =Перечисления.РаботаСДанными.Изменение;
					КонецЕсли;
					
					СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,Ссылка,Колонка.Имя,ТаблицаЗначений2[ТаблицаЗначений1.Индекс(СтрокаТаблицы)][Колонка.Имя],СтрокаТаблицы[Колонка.Имя],ИмяТаблицы,?(ТаблицаЗначений1.Колонки.Найти("НомерСтроки")=Неопределено ,"",СтрокаТаблицы.НомерСтроки),Событие,ТипОбъекта);	
					
				КонецЕсли;
				
			Исключение
				Если ТаблицаЗначений1.Колонки.Индекс(Колонка)+1=ТаблицаЗначений1.Колонки.Количество()тогда
					СтрокаТаблицыСтр=ПреобразоватьВСтроку(СтрокаТаблицы);
					Если Событие <> Перечисления.РаботаСДанными.Изменение  тогда
						Событие =Перечисления.РаботаСДанными.Изменение;
					КонецЕсли;
					
					СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,Ссылка," ","Нова стрічка",СтрокаТаблицыСтр,ИмяТаблицы,?(ТаблицаЗначений1.Найти("НомерСтроки")=Неопределено ,"",СтрокаТаблицы.НомерСтроки),Событие,ТипОбъекта);	
					
				КонецЕсли;
				
			КонецПопытки;
			
		КонецЦикла; 
		
		Для каждого СтрокаТаблицы Из ТаблицаЗначений2 Цикл
			
			Попытка
				Если СтрокаТаблицы[Колонка.Имя] <> ТаблицаЗначений1[ТаблицаЗначений2.Индекс(СтрокаТаблицы)][Колонка.Имя] Тогда
				КонецЕсли;
			Исключение
				Если ТаблицаЗначений1.Колонки.Индекс(Колонка)+1=ТаблицаЗначений2.Колонки.Количество()тогда
					СтрокаТаблицыСтр=ПреобразоватьВСтроку(СтрокаТаблицы);
					СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,Ссылка," ",СтрокаТаблицыСтр,"Видалено стрічку",ИмяТаблицы,?(ТаблицаЗначений1.Найти("НомерСтроки")=Неопределено ,"",СтрокаТаблицы.НомерСтроки),Событие,ТипОбъекта);	
				КонецЕсли;
				
			КонецПопытки;
			
		КонецЦикла;	
	КонецЦикла; 
КонецФункции // СравнитьТаблицыЗначений()

Функция СравнитьТекущиеДанные(Объект,РежимЗаписи = Неопределено, РежимПроведения = Неопределено)  Экспорт
	
	ЭлементЖурналаСобытий = Неопределено;
	
	ТипОбъекта = ВидОбъектаПоТипу(ТипЗнч(Объект.ссылка));
	Если ТипОбъекта = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	СсылкаНаОбъект = Объект.Ссылка;
	
	Если Объект.ЭтоНовый() Тогда
		
		СсылкаНового = Объект.ПолучитьСсылкуНового();
		Если НЕ ЗначениеЗаполнено(СсылкаНового) Тогда
			ОбъектМенеджер = МенеджерОбъектаПоСсылке(СсылкаНаОбъект);			
			СсылкаНового = ОбъектМенеджер.ПолучитьСсылку();
			Объект.УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли;
		
		СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,СсылкаНового,"","","","","",Перечисления.РаботаСДанными.СозданиеНового,ТипОбъекта);
		ЭлементЖурналаСобытий.Записать();
		
		Возврат Истина;
	конецЕсли;
	
	Событие=Перечисления.РаботаСДанными.Сохранение;
	
	Если НЕ СсылкаНаОбъект.ПометкаУдаления и  Объект.ПометкаУдаления Тогда
		Событие=Перечисления.РаботаСДанными.ПометкаНаУдаление;
	ИначеЕсли СсылкаНаОбъект.ПометкаУдаления и  не Объект.ПометкаУдаления Тогда
		Событие=Перечисления.РаботаСДанными.СнятиеПометкиНаУдаление;
	конецЕсли;
	
	Если ТипОбъекта = "Документ" Тогда
		Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) и (Объект.Проведен) Тогда
			Событие=Перечисления.РаботаСДанными.ПовторноеПроведение;
		ИначеЕсли (РежимЗаписи = РежимЗаписиДокумента.Проведение) и (не Объект.Проведен) Тогда
			Событие=Перечисления.РаботаСДанными.Проведение;
		ИначеЕсли (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) и (Объект.Проведен) Тогда
			Событие=?(Событие = Перечисления.РаботаСДанными.ПометкаНаУдаление,Перечисления.РаботаСДанными.ПометкаНаУдалениеПроведенногоДокумента,Перечисления.РаботаСДанными.ОтменаПроведения);
		КонецЕсли;
	иначеЕсли ТипОбъекта = "Справочник" Тогда
		Если Объект.Родитель <> СсылкаНаОбъект.Родитель тогда
			Событие = Перечисления.РаботаСДанными.ПереносВДругуюГруппу;
		КонецЕсли;	
	ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		Если Объект.Родитель <> СсылкаНаОбъект.Родитель тогда
			Событие = Перечисления.РаботаСДанными.ПереносВДругуюГруппу;
		КонецЕсли;	
	КонецЕсли;
	
	СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,СсылкаНаОбъект,"","","","",0,Событие,ТипОбъекта);	
	
	ИмяТаб			= "Реквізит " ;
	Для каждого РеквизитОбъекта Из Объект.метаданные().СтандартныеРеквизиты Цикл
		Если Объект[РеквизитОбъекта.Имя] <> СсылкаНаОбъект[РеквизитОбъекта.Имя] Тогда
			Если  Не РеквизитОбъекта.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда 
				СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,СсылкаНаОбъект,РеквизитОбъекта.Имя,СсылкаНаОбъект[РеквизитОбъекта.Имя],Объект[РеквизитОбъекта.Имя],ИмяТаб,0,?(Событие=Перечисления.РаботаСДанными.Сохранение,Перечисления.РаботаСДанными.Изменение,Событие),ТипОбъекта);	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	
	Для каждого РеквизитОбъекта Из Объект.Метаданные().Реквизиты Цикл
		Если Объект[РеквизитОбъекта.Имя] <> СсылкаНаОбъект[РеквизитОбъекта.Имя] Тогда
			Если  не РеквизитОбъекта.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда 
				СоздатьНовоеСобытие(ЭлементЖурналаСобытий,Объект,СсылкаНаОбъект,РеквизитОбъекта.Имя,СсылкаНаОбъект[РеквизитОбъекта.Имя],Объект[РеквизитОбъекта.Имя],ИмяТаб,0,?(Событие=Перечисления.РаботаСДанными.Сохранение,Перечисления.РаботаСДанными.Изменение,Событие),ТипОбъекта);	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	
	Для каждого ТЧОбъекта Из Объект.Метаданные().ТабличныеЧасти Цикл
		СравнитьТаблицыЗначений(ЭлементЖурналаСобытий,Объект,СсылкаНаОбъект,Объект[ТЧОбъекта.Имя].Выгрузить(), СсылкаНаОбъект[ТЧОбъекта.Имя].Выгрузить(),ТЧОбъекта.Синоним,?(Событие=Перечисления.РаботаСДанными.Сохранение,Перечисления.РаботаСДанными.Изменение,Событие),ТипОбъекта) ;
	КонецЦикла;
	
	Если Не (ЭлементЖурналаСобытий = Неопределено) Тогда 
		ЭлементЖурналаСобытий.ДаныеСобытия.Сортировать("НомерСтрокиДока Возр");
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.СохраненныеНастройки") 
				и ЭлементЖурналаСобытий.Событие = Перечисления.РаботаСДанными.Сохранение 
				и ЭлементЖурналаСобытий.ДаныеСобытия.Количество() = 0 Тогда 
				Возврат Истина; //не будем фиксировать такой мусор
		КонецЕсли;	
		
		Пока ЭлементЖурналаСобытий.ДаныеСобытия.Количество() > 9999  Цикл 
			ЭлементЖурналаСобытий.ДаныеСобытия.Удалить(0);
		КонецЦикла;	
			
		ЭлементЖурналаСобытий.Записать();
	КонецЕсли;
КонецФункции



Процедура ДокументыПередЗаписьюЖурналСобытий(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	Если не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда //это загрузка из главной базы
		Возврат;
	КонецЕсли;	
	
	
	
	СравнитьТекущиеДанные(Объект,РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура СправочникиПередЗаписьюЖурналСобытий(Объект, Отказ) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	Если не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда //это загрузка из главной базы
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.ЖурналСобытий")  Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.ТипыОбъектовЖурналСобытий") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
		Попытка
			Если ПараметрыСеанса.ТекущийПользователь = Неопределено Тогда
				Возврат;
			КонецЕсли;
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	СравнитьТекущиеДанные(Объект);	
КонецПроцедуры	

Процедура ЗадачаПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	Если не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда //это загрузка из главной базы
		Возврат;
	КонецЕсли;	
	
	СравнитьТекущиеДанные(Источник);	
КонецПроцедуры

Процедура БизнесПроцессПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если не ПланыОбмена.ГлавныйУзел() = Неопределено Тогда //это загрузка из главной базы
		Возврат;
	КонецЕсли;	
	
	СравнитьТекущиеДанные(Источник);	
КонецПроцедуры


Процедура ДокументыПередУдалениемПередУдалением(Источник, Отказ) Экспорт      
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТипОбъекта 	= ВидОбъектаПоТипу(ТипЗнч(Источник.ссылка));
	Событие 	= Перечисления.РаботаСДанными.НепосредственноеУдаление;
	ЭлементЖурналаСобытий = Неопределено;
	СоздатьНовоеСобытие(,Источник,Источник.Ссылка,,,,,,Событие,ТипОбъекта);
	Если Не (ЭлементЖурналаСобытий = Неопределено) Тогда 
		ЭлементЖурналаСобытий.ДаныеСобытия.Сортировать("НомерСтрокиДока Возр");
		ЭлементЖурналаСобытий.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура СправочникиПередУдалением(Источник, Отказ) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ЖурналСобытий")  Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи") Тогда
		Попытка
			Если ПараметрыСеанса.ТекущийПользователь = Неопределено Тогда
				Возврат;
			КонецЕсли;
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	ТипОбъекта 	= ВидОбъектаПоТипу(ТипЗнч(Источник.ссылка));
	Событие 	= Перечисления.РаботаСДанными.НепосредственноеУдаление;
	ЭлементЖурналаСобытий = Неопределено;
	СоздатьНовоеСобытие(,Источник,Источник.Ссылка,,,,,,Событие,ТипОбъекта);
	Если Не (ЭлементЖурналаСобытий = Неопределено) Тогда 
		ЭлементЖурналаСобытий.ДаныеСобытия.Сортировать("НомерСтрокиДока Возр");
		ЭлементЖурналаСобытий.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ЗадачаПередУдалениемПередУдалением(Источник, Отказ) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТипОбъекта 	= ВидОбъектаПоТипу(ТипЗнч(Источник.ссылка));
	Событие 	= Перечисления.РаботаСДанными.НепосредственноеУдаление;
	ЭлементЖурналаСобытий = Неопределено;
	СоздатьНовоеСобытие(,Источник,Источник.Ссылка,,,,,,Событие,ТипОбъекта);
	Если Не (ЭлементЖурналаСобытий = Неопределено) Тогда 
		ЭлементЖурналаСобытий.ДаныеСобытия.Сортировать("НомерСтрокиДока Возр");
		ЭлементЖурналаСобытий.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура БизнесПроцессПередУдалениемПередУдалением(Источник, Отказ) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТипОбъекта 	= ВидОбъектаПоТипу(ТипЗнч(Источник.ссылка));
	Событие 	= Перечисления.РаботаСДанными.НепосредственноеУдаление;
	ЭлементЖурналаСобытий = Неопределено;
	СоздатьНовоеСобытие(,Источник,Источник.Ссылка,,,,,,Событие,ТипОбъекта);
	Если Не (ЭлементЖурналаСобытий = Неопределено) Тогда 
		ЭлементЖурналаСобытий.ДаныеСобытия.Сортировать("НомерСтрокиДока Возр");
		ЭлементЖурналаСобытий.Записать();
	КонецЕсли;
КонецПроцедуры



///////////////////////////////////

// Функция ВидОбъектаПоСсылке возвращает имя вида объектов метаданных
// по ссылке на объект.
//
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//
// Возвращаемое значение:
//  Строка       - имя вида объектов метаданных, например, "Справочник", "Документ" ...
// 
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт
	
	Возврат ВидОбъектаПоТипу(ТипЗнч(Ссылка));
	
КонецФункции 

// Функция возвращает имя вида объектов метаданных по типу объекта.
//
// Не обрабатываются точки маршрутов бизнес-процессов.
//
// Параметры:
//  Тип       - Тип прикладного объекта, определенный в конфигурации
//
// Возвращаемое значение:
//  Строка       - имя вида объектов метаданных, например, "Справочник", "Документ" ...
// 
Функция ВидОбъектаПоТипу(Тип) Экспорт
	Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Справочник";
	
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Документ";
	
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "БизнесПроцесс";
	
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланВидовХарактеристик";
	
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланСчетов";
	
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланВидовРасчета";
	
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Задача";
	
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "ПланОбмена";
	
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат "Перечисление";
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 

Функция МенеджерОбъектаПоСсылке(Ссылка) Экспорт
	Тип = ТипЗнч(Ссылка);
	Если Справочники.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат Справочники[Ссылка.Метаданные().Имя];
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат Документы[Ссылка.Метаданные().Имя];
	
	ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат БизнесПроцессы[Ссылка.Метаданные().Имя];
	
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат ПланыВидовХарактеристик[Ссылка.Метаданные().Имя];
	
	ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат ПланыСчетов[Ссылка.Метаданные().Имя];
	
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат ПланыВидовРасчета[Ссылка.Метаданные().Имя];
	
	ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат Задачи[Ссылка.Метаданные().Имя];
	
	ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат ПланыОбмена[Ссылка.Метаданные().Имя];
	
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда
		Возврат Перечисления[Ссылка.Метаданные().Имя];
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции 


Функция ПолучитьОбъектПоНаименованиюИГУИД(Наименование,НаименованиеПолное,Стр) Экспорт 
	Если СокрЛП(Наименование) = "Справочник" тогда
		Возврат Справочники[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	ИначеЕсли СокрЛП(Наименование) = "Документ" тогда
		Возврат Документы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	ИначеЕсли СокрЛП(Наименование) = "Задача" тогда
		Возврат Задачи[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	ИначеЕсли СокрЛП(Наименование) = "БизнесПроцесс" тогда
		Возврат БизнесПроцессы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр)));
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции	

Функция ПолучитьДатуОбъектаПоНаименованиюИГУИД(Наименование,НаименованиеПолное,Стр) Экспорт 
	Если СокрЛП(Наименование) = "Справочник" тогда
		Возврат Неопределено;
	ИначеЕсли СокрЛП(Наименование) = "Документ" тогда
		Возврат Документы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр))).Дата;
	ИначеЕсли СокрЛП(Наименование) = "Задача" тогда
		Возврат Задачи[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр))).Дата;
	ИначеЕсли СокрЛП(Наименование) = "БизнесПроцесс" тогда
		Возврат БизнесПроцессы[СокрЛП(НаименованиеПолное)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Стр))).Дата;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
